# Задача 1: максимум нечётных чисел
a = [12, 25, 40, 7, 15, 3, 50, 9, 5, 18]
odd = [x for x in a if x % 2 != 0]
print("Максимальное нечётное число:", max(odd) if odd else "нет нечётных чисел")

# Задача 2: максимум по дополнительной диагонали 4x4
A = [
    [2, 7, 3, 9],
    [1, 5, 8, 4],
    [6, 0, 11, 12],
    [14, 13, 10, 15]
]
n = len(A)
diag = [A[i][n - 1 - i] for i in range(n)]
print("Максимальный элемент по дополнительной диагонали:", max(diag))
